# vstSetWPHybridTool

## Description
Set the working plane on the layer preparing it for hybrid tool.

```pascal
PROCEDURE vstSetWPHybridTool(message1 : LONGINT);
```

```python
def vs.vstSetWPHybridTool(message1):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|message1|LONGINT|   |

## Version
Availability: from Vectorworks 2011

## Category
* Tool Events